emacs/.emacs.d/Emacs.org
#+title: Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes
* Contents :TOC:QUOTE:
#+BEGIN_QUOTE
- [[#early-init][Early-Init]]
  - [[#cache-e-directory-di-supporto][Cache e directory di supporto]]
  - [[#garbage-collector-e-warnings][Garbage collector e warnings]]
  - [[#ui-tweaks][UI tweaks]]
  - [[#startup-speedup][Startup speedup]]
- [[#emacs-literate-config-file][Emacs literate config file]]
- [[#startup-config][Startup config]]
  - [[#loading-time][Loading time]]
  - [[#package-manager][Package Manager]]
  - [[#pulizia-cartella-emacsd][Pulizia cartella .emacs.d]]
  - [[#garbage-collection][Garbage collection]]
  - [[#package-updates][Package updates]]
- [[#main-config][Main config]]
  - [[#tramp][Tramp]]
  - [[#macos][Macos]]
- [[#ui][UI]]
  - [[#tema][Tema]]
  - [[#modeline][Modeline]]
  - [[#parentesi][Parentesi]]
- [[#evil][Evil]]
  - [[#evil-undo-fo][Evil-undo-fo]]
  - [[#evil][Evil]]
  - [[#evil-collection-e-setup][Evil-collection e setup]]
  - [[#evil-agenda][Evil-agenda]]
  - [[#folding][Folding]]
- [[#keybinds][Keybinds]]
  - [[#general-el-keybinds-con-prefisso][General-el: keybinds con prefisso]]
  - [[#transient-keybinds-con-menu][Transient: keybinds con menu]]
  - [[#general-keybinds][General keybinds]]
- [[#formattazione-e-pulizia-file][Formattazione e pulizia file]]
  - [[#testo][Testo]]
  - [[#specifico-per-estensione][Specifico per estensione]]
- [[#completion-frameworks][Completion frameworks]]
  - [[#vertico][Vertico]]
- [[#org-mode][Org mode]]
  - [[#funzioni-per-lagenda-con-org-roam][Funzioni per l'agenda con org-roam]]
  - [[#org-package][Org package]]
  - [[#super-agenda][Super agenda]]
  - [[#table-of-contents][Table-of-contents]]
  - [[#ui][UI]]
- [[#file-browsing][File browsing]]
  - [[#dired][Dired]]
  - [[#openfile][OpenFile]]
- [[#org-roam][Org roam]]
  - [[#funzioni-di-appoggio][Funzioni di appoggio]]
  - [[#configurazione][Configurazione]]
- [[#ledger][Ledger]]
  - [[#evil-ledger][Evil Ledger]]
- [[#bibtex][Bibtex]]
- [[#git][Git]]
  - [[#magit][Magit]]
  - [[#git-link][Git-link]]
  - [[#git-gut][Git-gut]]
- [[#progetti][Progetti]]
  - [[#projectile][Projectile]]
  - [[#perspective][Perspective]]
- [[#lsp][LSP]]
  - [[#general-setup][General setup]]
  - [[#debugger][Debugger]]
- [[#programmazione][Programmazione]]
  - [[#python][Python]]
- [[#elfeed][Elfeed]]
  - [[#elfeed-base][Elfeed base]]
  - [[#elfeed-arxiv-keybinds][Elfeed Arxiv: Keybinds]]
  - [[#elfeed-score][Elfeed Score]]
- [[#variabili-locali][Variabili locali]]
#+END_QUOTE

* Early-Init
Configurazioni da caricare il prima possibile nel file early-init.el
#+begin_src emacs-lisp :tangle early-init.el
;;; -*- lexical-binding: t; -*-
; File generato automaticamente da emacs.org
#+end_src
** Cache e directory di supporto
Istruzioni trovate nel README del package no-littering
#+begin_src emacs-lisp :tangle early-init.el
(push "~/.emacs.d/lisp/elfeed/" load-path)
(setq emacs-original-dir user-emacs-directory)

(setq user-emacs-directory "~/.cache/emacs")
(setq package-user-dir "~/.cache/emacs/packages")

(when (fboundp 'startup-redirect-eln-cache)
  (startup-redirect-eln-cache
   (convert-standard-filename
	  (expand-file-name  "var/eln-cache/" user-emacs-directory))))
#+end_src
** Garbage collector e warnings
#+begin_src emacs-lisp :tangle early-init.el
;; Meno warnings
(setq comp-async-report-warnings-errors nil)

;; Garbage collector
(setq gc-cons-threshold most-positive-fixnum
    gc-cons-percentage 0.6)
#+end_src
** UI tweaks
#+begin_src emacs-lisp :tangle early-init.el
;; UI
(push '(menu-bar-lines .0) default-frame-alist)
(push '(tool-bar-lines .0) default-frame-alist)
(push '(vertical-scroll-bars) default-frame-alist)
(push '(mode-line-format . 0) default-frame-alist)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(tooltip-mode -1)
(menu-bar-mode -1)
#+end_src
** Startup speedup
#+begin_src emacs-lisp :tangle early-init.el
;; Fast-startup
(setq package-enable-at-startup nil)
(setq package-quickstart t)
(setq frame-inhibit-implied-resize t)
(advice-add #'x-apply-session-resources :override #'ignore)
#+end_src

* Emacs literate config file
Una prova di un file di configurazione letterale
#+begin_src emacs-lisp
;; -*- lexical-binding: t; -*-
;; File generato automaticamente, cambiare il emacs.org
#+end_src

* Startup config
** Loading time
Funzione per riportare il tempo di load
#+begin_src emacs-lisp
(add-hook 'emacs-startup-hook
	  (lambda ()
	    (message "!!! Emacs loader in %s with %d garbage collections."
		     (format "%.3f seconds"
			     (float-time
			      (time-subtract after-init-time before-init-time)))
		     gcs-done)))
(setq use-package-verbose t)

#+end_src
** Package Manager
*** Package.el
Init e configurazione di use-package 
#+begin_src emacs-lisp :tangle no
(require 'package)
(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))
;; Initialize use-package
(package-initialize)
(unless (package-installed-p 'use-package)
   (package-install 'use-package))
(require 'use-package)

(unless (package-installed-p 'use-package)
	(package-refresh-contents)
	(package-install 'use-package))
;; Configurazione use-package
(eval-and-compile
   (setq use-package-always-ensure nil)
   (setq use-package-always-defer nil)
   (setq use-package-always-demand nil)
   (setq use-package-expand-minimally nil)
   (setq use-package-enable-imenu-support t)
   (setq use-package-compute-statistics nil)
   (setq use-package-hook-name-suffix nil))
(eval-when-compile
        (require 'use-package))
#+end_src
*** Straight.el
#+begin_src emacs-lisp 
;; Bootstrap straight.el
(defvar bootstrap-version)
(let ((bootstrap-file
      (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
        "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
        'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; Always use straight to install on systems other than Linux
(setq straight-use-package-by-default (not (eq system-type 'gnu/linux)))

;; Use straight.el for use-package expressions
(straight-use-package 'use-package)

;; Load the helper package for commands like `straight-x-clean-unused-repos'
(require 'straight-x)
#+end_src
** Pulizia cartella .emacs.d
Packages per mantenere la cartella .emacs.d pulita ed installare tutto nella .cache
#+begin_src emacs-lisp
(use-package no-littering
  :ensure
  :config
  (setq auto-save-file-name-transforms
	`((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))
  (setq custom-file (no-littering-expand-etc-file-name "custom.el"))
  )
#+end_src
** Garbage collection
#+begin_src emacs-lisp
(use-package gcmh
  :ensure t
  :custom
  (gcmh-mode 1)
  (gcmh-idle-delay 5)
  (gcmh-high-cons-threshold (* 16 1024 1024))
  (gc-cons-percentage 0.1))
#+end_src
** Package updates
Tiene sepre tutto aggiornato
#+begin_src emacs-lisp
(use-package auto-package-update
  :disabled
  :ensure t
  :custom
  (auto-package-update-interval 7)
  (auto-package-update-prompt-before-update t)
  (auto-package-update-hide-results t)
  :config
  (auto-package-update-maybe)
  (auto-package-update-at-time "09:00"))
#+end_src
* Main config
Setup generale di emacs
#+begin_src emacs-lisp
(use-package emacs
  :init
  (set-face-attribute 'default nil :height 180) ;; Font
  (set-face-attribute 'fixed-pitch nil :height 180) ;; Font
  (set-face-attribute 'variable-pitch nil :height 180) ;; Font
  ;; Vertico setup
  (setq enable-recursive-minibuffers t)
  :config
  (set-language-environment "UTF-8")
  (set-default-coding-systems 'utf-8-unix)
  (setq-default frame-title-format '("%b"))
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit) ;; TODO Separare il keybind
  (global-display-line-numbers-mode)
  ;;(server-start)
  :custom
  (inhibit-startup-screen t)
  (initial-scratch-message "")
  (use-short-answer t)
  (read-process-output-max (* 1024 1024))
  ;;(user-emacs-directory "~/.cache/emacs")
  (tramp-default-method "ssh")
  (vc-follow-symlinks t)
  (delete-old-versions -1) ;; Avoid excessive backups
  (version-control t)
  (vc-make-backup-files t)
  (setq-default indent-tabs-mode nil)

  )
(when (display-graphic-p)
  (set-frame-parameter (selected-frame) 'alpha '(90 . 90))
  (add-to-list 'default-frame-alist '(alpha . (90 . 90)))
  (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
  (add-to-list 'default-frame-alist '(fullscreen . maximized)))
#+end_src
** Tramp
#+begin_src emacs-lisp
(eval-after-load 'tramp '(setenv "SHELL" "/bin/bash"))
(eval-after-load 'tramp '(setq doom-modeline-buffer-file-name-style 'file-name))
#+end_src
** Macos
*** Binds 
Tastiera italiana 
#+begin_src emacs-lisp
;; https://emacs.stackexchange.com/questions/37172/how-to-insert-special-characters-not-on-a-us-uk-keyboard
(when (memq window-system '(mac ns))
  (setq ns-command-modifier 'meta)
  (setq ns-alternate-modifier nil))
#+end_src
*** Variabili shell
Su MacOs lanciando l'app di Emacs non vengono viste le variabili nello .zprofile.
Aggiungere le variabili a Library/LaunchAgents/environment.plist
#+begin_src sh :tangle no
launch setenv CUSTOM_VAR value
#+end_src

* UI
** Tema
Basato su doom per il momento
#+begin_src emacs-lisp
;;;; Tema
(use-package doom-themes
  :ensure t
  :config
  (load-theme 'doom-one t)
  (doom-themes-neotree-config)
  (doom-themes-org-config))
#+end_src

** Modeline
#+begin_src emacs-lisp
;; Best addition ever
(use-package poke-line
  :ensure t
  :init
  (poke-line-global-mode 1)
  (setq-default poke-line-pokemon "gengar")
  )
;; Modeline
(use-package doom-modeline
  :ensure t
  :init
  (doom-modeline-mode 1)
  :custom
  (doom-modeline-buffer-file-name-style 'relative-to-project)
  (doom-modeline-lsp t)
  )
#+end_src
** Parentesi
Colora le parentesi
#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :ensure t
  :hook (prog-mode-hook . rainbow-delimiters-mode))
#+end_src
* Evil 
** Evil-undo-fo
Da caricare prima di evil per avere una funzione di undo avanzata
#+begin_src emacs-lisp
(use-package undo-fu
  :after emacs
  :ensure
  :init
  )
(use-package undo-fu-session
  :after undo-fu
  :defer 1
  :ensure
  :config
  (setq undo-fu-session-file-limit 1024)
  (global-undo-fu-session-mode 1)
  )
#+end_src
