emacs/.emacs.d/Emacs.org
** Evil
#+begin_src emacs-lisp
;; Evil config
(use-package evil
  :ensure
  :after undo-fu
  :init	
  ;; Spostamenti
  (setq evil-want-integration t) ;; TODO: Capire cosa fa
  (setq evil-want-keybinding nil) ;; TODO: Capire cosa fa
  (setq evil-want-C-i-jump nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-u-delete t)
  (setq evil-respect-visual-line-mode t)
  ;; Search
  (setq evil-search-module 'evil-search)
  ;; Indentazione
  (setq evil-shift-width 4) ;; Questo e' il default
  ;; Undo-Redo
  (setq evil-undo-system 'undo-fu)
  ;; Vim-like
  :config
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
  (evil-mode 1)
  :custom
  (evil-vsplit-window-right t)
  )
#+end_src
** Evil-collection e setup
Un package che aggiunge keybinds basati su evil per multipli altri packages
#+begin_src emacs-lisp
(use-package evil-collection
  :ensure
  :after evil
  :init
  :custom
  (evil-collection-outline-bind-tab-p nil)
  (collection-setup-minibuffer t)
  (evil-collection-calendar-want-org-bindings t)
  :config
  (evil-collection-init)
  )
#+end_src
** Evil-agenda
#+begin_src emacs-lisp 
(use-package evil-org
  :ensure
  :after org
  :hook (org-mode . (lambda () evil-org-mode))
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys)
)
#+end_src
** Folding
#+begin_src emacs-lisp
;; Folding
(use-package vimish-fold
  :ensure t
  :defer 2
  :after evil)

(use-package evil-vimish-fold
  :ensure t
  :after vimish-fold
  :init
  (setq evil-vimish-fold-mode-lighter " ")
  (setq evil-vimish-fold-target-modes '(prog-mode conf-mode text-mode))
  :config
  (global-evil-vimish-fold-mode)
 )
#+end_src

* Keybinds
** General-el: keybinds con prefisso
Aggiunge keybinds con prefisso e vari hook, disattivato per il momento
#+begin_src emacs-lisp

(use-package general
  :ensure t
  :after evil
  :config
  (general-evil-setup t)
  (general-create-definer fd/supreme-leader
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC")
  ;(general-define-key
  ; :states '(normal visual insert emacs)
  ; :prefix "SPC"
  ; :non-normal-prefix "C-SPC"
  ;  "c" '((lambda () (interactive) (find-file "~/.emacs.d/Emacs.org")) :which-key "Open Configuration")
  ;  "a" '(org-agenda :which-key "Agenda")
  ;  "SPC" '(find-file :which-key "Find file")
  ;  ;; Buffers
  ;  "b" '(:ignore t :which-key "Buffers")
  ;  "be" '(eval-buffer :which-key "Eval")
  ;  ;; Windows
  ;  "w" '(:ignore t :which-key "Windows")
  ;  "wv" '(split-window-vertically :which-key "Vertical Split")
  ;  "wh" '(split-window-horizontally :which-key "Horizontal Split")
  ;  ;; Org
  ;  "o" '(:ignore t :which-key "Org")
  ;  ;; Elfeed
  ;  "e" '(:ignore t :which-key "Elfeed")
  ;  "eo" '(elfeed :which-key "Open feed")
  ;  "eu" '(elfeed-update :which-key "Update feed"))
  )
#+end_src
Which-key permette di mostrare in un menu ogni keybind, da rivedere
#+begin_src emacs-lisp
(use-package which-key
  :ensure t
  :after general
  :diminish which-key-mode
  :config
  (setq which-key-sort-order 'which-key-prefix-then-key-order)
  (setq which-key-idle-delay 0.3)
  (which-key-mode)
)
#+end_src

** Transient: keybinds con menu
Alternativa complessa a general, in fase di test, disabilitata per ora
#+begin_src emacs-lisp :tangle no
(use-package transient
  :ensure t
  :after evil
  :config
  (define-transient-command org-roam-transient ()
    "Buffers"
    ["Suffixes"
     ("i" "Insert" org-roam-node-insert :transient nil)
     ("o" "Open" org-roam-node-open :transient nil)
     ("f" "Find" org-roam-node-find :transient nil)
    ])
  (define-transient-command org-transient ()
    ["Suffixes"
     ("c" "Cycle" org-cycle :transient nil)
    ])
  (define-transient-command buffers-transient ()
    "Buffers"
    ["Suffixes"
     ("e" "Eval" eval-buffer :transient nil)]
    )
  (define-transient-command general-transient ()
    "Main Menu"
    ["Suffixes"
     ("a" "Agenda" org-agenda :transient nil)
     ("c" "Config" (lambda () (interactive) (find-file "~/.emacs.d/Emacs.org")) :transient nil)
     ("SPC" "Find file" find-file :transient nil)]
    ["Nested"
     ("b" "Buffer" buffers-transient)
     ("o" "Org" org-transient)]
    ) 
  (define-key evil-insert-state-map (kbd "C-SPC") 'general-transient)
  (define-key evil-normal-state-map (kbd "SPC") 'general-transient) ;; TODO Kill the buffer with ESC
)
#+end_src
** General keybinds
#+begin_src emacs-lisp
(fd/supreme-leader
  "c" '((lambda () (interactive) (find-file "~/.emacs.d/Emacs.org")) :which-key "Open Configuration")
  "a" '(org-agenda :which-key "Agenda")
  "SPC" '(find-file :which-key "Find file")
  ;; Windows
  "w" '(:ignore t :which-key "Windows")
  "wv" '(split-window-vertically :which-key "Vertical Split")
  "wh" '(split-window-horizontally :which-key "Horizontal Split")
  "wk" '(split-window-horizontally :which-key "Kill windows")
  ;; Buffers
  "b" '(:ignore t :which-key "Buffers")
  "be" '(eval-buffer :which-key "Eval")
  ;; Roam!
  "o" '(:ignore t :which-key "Org-Roam")
  "oi" '(org-roam-node-insert :which-key "Insert node")
  "of" '(org-roam-node-find :which-key "Find node")
 )

#+end_src
* Formattazione e pulizia file
** Testo
Rimozione di righe vuote e spazi bianchi finali
#+begin_src emacs-lisp
(use-package ws-butler
  :hook ((text-mode . ws-butler-mode)
         (prog-mode . ws-butler-mode)))
#+end_src
** Specifico per estensione
Package che richiede l'installazione di vari strumenti per la formattazione
#+begin_src emacs-lisp
(use-package format-all
  :disabled
  :ensure
  :init
  ;; TODO Aggiungere un keybind per Black
  )
#+end_src
* Completion frameworks
** Vertico
Moduli del framework vertico che ho attivato
*** Vertico 
Modulo di base del framework e package per salvare comandi precedenti
#+begin_src emacs-lisp
(use-package vertico
  :ensure t
  :custom
  (vertico-cycle t)
  ;;:custom-face
  ;;(vertico-current ((t (:background "#3a3f5a"))))
  :init
  (vertico-mode))

;; Persist history over Emacs restarts. Vertico sorts by history position.
(use-package savehist
  :init
  (savehist-mode))
#+end_src
*** Altri
Ancora da attivare e settare
#+begin_src emacs-lisp
;; Da attivare piano piano
;;(use-package orderless  :ensure t)
;;(use-package marginalia  :ensure t)
;;(use-package embark  :ensure t)
;;(use-package consult  :ensure t)
;;(use-package embark-consult  :ensure t)
#+end_src
* Org mode
** Funzioni per l'agenda con org-roam
Permettono di selezionare solo i file org con TODO inseriti
#+begin_src emacs-lisp
(defun my/agenda-fetch ()
  ;; 1. Se voglio aggiungere una task ad un file nuovo?!
  ;; 2. Se non ne trova non parte l'agenda
  ;;(interactive)
  (split-string 
   (shell-command-to-string (concat "rg --type org '" locregex "' " org-agenda-base " -l "))
   "\n")
   )
(defun my/update-agenda (&rest _)
  ;;(interactive)
  (setq org-agenda-files (my/agenda-fetch)))
#+end_src
** Org package
Unico blocco diviso in più sezioni
*** Init
Evita di caricare allo startup org
#+begin_src emacs-lisp
(defun cst-org ()
      (org-indent-mode)
      (visual-line-mode 1)
)
(use-package org
    :defer t
    :init
    (add-hook 'org-mode-hook 'cst-org)
    :config
#+end_src
*** Agenda
Scritta per funzionare con org-roam, richiede settata la variabile ORG_PATH
**** Status tasks
#+begin_src emacs-lisp
  (setq string-todos '("TODO" "ACTIVE" "DONE" "HOLD" "CANCELED"))
  (setq locregex (string-join string-todos "|"))
  (setq org-agenda-base (getenv "ORG_PATH"))
  (setq org-agenda-files '(my/update-agenda))
  (setq org-todo-keywords
      '((sequence "TODO(t@)" "ACTIVE(a@)" "|" "DONE(d@)") ;;   Generali
	(sequence  "|" "HOLD(h@)" "CANCELED(c@)")
	))
#+end_src
**** Tags
#+begin_src emacs-lisp
  (setq org-tag-alist
    '((:startgroup)
       ; Put mutually exclusive tags here
       (:endgroup)
       ("note" . ?n)
       ("idea" . ?i)))
  (advice-add 'org-agenda :before #'my/update-agenda)
  (advice-add 'org-todo-list :before #'my/update-agenda)
#+end_src
**** Views
#+begin_src emacs-lisp
 (setq org-agenda-custom-commands nil)
 (setq org-agenda-custom-commands
      '(("ces" "Custom: Agenda and Emacs SOMEDAY [#A] items"
         ((org-ql-block '(todo "TODO")
                        ((org-ql-block-header "SOMEDAY :Emacs: High-priority")))
          (agenda)))))

#+end_src
*** Babel
Tangle di file e moduli aggiungtivi
#+begin_src emacs-lisp
  (org-babel-do-load-languages
    'org-babel-load-languages
    '((emacs-lisp . t)
      ))
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("sh" . "src sh"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  ;;(setq org-src-tab-acts-natively t)
  (setq org-src-preserve-indentation t)
#+end_src
*** Fine org
#+begin_src emacs-lisp
)
#+end_src
** Org-ql
#+begin_src emacs-lisp
(use-package org-ql
  :straight (:files (:defaults (:exclude"helm-org-ql.el")))
  :defer t
  )
#+end_src
