emacs/.emacs.d/Emacs.org
** Super agenda
Una versione aggiornata che permette di raggruppare le entries.
#+begin_src emacs-lisp
(use-package org-super-agenda
  :ensure t
  :after org
  :init
  (setq org-super-agenda-header-map (make-sparse-keymap))
  ;;:hook (org-agenda-mode . org-super-agenda-mode)
  :config
  (org-super-agenda-mode 1)
  (setq org-super-agenda-groups
        '(;; Each group has an implicit boolean OR operator between its selectors.
          (:name "Today"  ; Optionally specify section name
                 ;;:time-grid t  ; Items that appear on the time grid
                 :todo t)  ; Items that have this TODO keyword
          ))
  )
#+end_src
** Table-of-contents
#+begin_src emacs-lisp
(use-package toc-org
  :ensure t
  :after org
)
#+end_src
** UI
*** Colora i TODOs
Al momento non funzione nell'agenda.
#+begin_src emacs-lisp :tangle no
(use-package hl-todo
  :ensure t
  :after org
  :init
  :config
  (setq hl-todo-keyword-faces
	'(("TODO" . "#FF0000")
	  ("ACTIVE" . "#00fffe")
	  ("DONE" . "#00FF00")
	  ))
  (setq org-todo-keyword-faces hl-todo-keyword-faces)
  (hl-todo-mode)
  )
#+end_src
*** Text scaling
Keybindings da usare C+M+- e C+M+=.
#+begin_src emacs-lisp 
(use-package default-text-scale
  :defer 1
  :config
  (default-text-scale-mode))
#+end_src
*** Markup
#+begin_src emacs-lisp
(use-package org-appear
  :ensure
  :hook (org-mode . org-appear-mode))
#+end_src
* File browsing
** Dired
Migliora le funzioni di default del file manager.
Su MacOS bisogna:
1. aggiungere i permessi di accesso a tutto il disco a /usr/bin/ruby
2. avere coreutils installato con homebrew oppure rimuovere "-group-directories-first"
*** Base config
#+begin_src emacs-lisp 
(use-package all-the-icons-dired
  :ensure) ;; Forse da limitare su terminale?

(use-package dired
  :ensure nil
  :straight nil
  :defer 1
  :commands (dired dired-jump)
  :config
  (when (eq system-type 'darwin)
    (setq insert-directory-program "/usr/local/bin/gls"))
  (setq dired-listing-switches "-agho --group-directories-first"
        dired-omit-files "^\\.[^.].*"
        dired-omit-verbose nil
        dired-hide-details-hide-symlink-targets nil
        delete-by-moving-to-trash t)

  (autoload 'dired-omit-mode "dired-x")

  (add-hook 'dired-load-hook
            (lambda ()
              (interactive)
              (dired-collapse)))

  (add-hook 'dired-mode-hook
            (lambda ()
              (interactive)
              (dired-omit-mode 1)
              (dired-hide-details-mode 1)
              (when (display-graphic-p)
                (all-the-icons-dired-mode 1))
              (hl-line-mode 1))))
#+end_src
*** Colori
#+begin_src emacs-lisp
(use-package dired-rainbow
    :ensure
    :defer 2
    :config
    (dired-rainbow-define-chmod directory "#6cb2eb" "d.*")
    (dired-rainbow-define html "#eb5286" ("css" "less" "sass" "scss" "htm" "html" "jhtm" "mht" "eml" "mustache" "xhtml"))
    (dired-rainbow-define xml "#f2d024" ("xml" "xsd" "xsl" "xslt" "wsdl" "bib" "json" "msg" "pgn" "rss" "yaml" "yml" "rdata"))
    (dired-rainbow-define document "#9561e2" ("docm" "doc" "docx" "odb" "odt" "pdb" "pdf" "ps" "rtf" "djvu" "epub" "odp" "ppt" "pptx"))
    (dired-rainbow-define markdown "#ffed4a" ("org" "etx" "info" "markdown" "md" "mkd" "nfo" "pod" "rst" "tex" "textfile" "txt"))
    (dired-rainbow-define database "#6574cd" ("xlsx" "xls" "csv" "accdb" "db" "mdb" "sqlite" "nc"))
    (dired-rainbow-define media "#de751f" ("mp3" "mp4" "mkv" "MP3" "MP4" "avi" "mpeg" "mpg" "flv" "ogg" "mov" "mid" "midi" "wav" "aiff" "flac"))
    (dired-rainbow-define image "#f66d9b" ("tiff" "tif" "cdr" "gif" "ico" "jpeg" "jpg" "png" "psd" "eps" "svg"))
    (dired-rainbow-define log "#c17d11" ("log"))
    (dired-rainbow-define shell "#f6993f" ("awk" "bash" "bat" "sed" "sh" "zsh" "vim"))
    (dired-rainbow-define interpreted "#38c172" ("py" "ipynb" "rb" "pl" "t" "msql" "mysql" "pgsql" "sql" "r" "clj" "cljs" "scala" "js"))
    (dired-rainbow-define compiled "#4dc0b5" ("asm" "cl" "lisp" "el" "c" "h" "c++" "h++" "hpp" "hxx" "m" "cc" "cs" "cp" "cpp" "go" "f" "for" "ftn" "f90" "f95" "f03" "f08" "s" "rs" "hi" "hs" "pyc" ".java"))
    (dired-rainbow-define executable "#8cc4ff" ("exe" "msi"))
    (dired-rainbow-define compressed "#51d88a" ("7z" "zip" "bz2" "tgz" "txz" "gz" "xz" "z" "Z" "jar" "war" "ear" "rar" "sar" "xpi" "apk" "xz" "tar"))
    (dired-rainbow-define packaged "#faad63" ("deb" "rpm" "apk" "jad" "jar" "cab" "pak" "pk3" "vdf" "vpk" "bsp"))
    (dired-rainbow-define encrypted "#ffed4a" ("gpg" "pgp" "asc" "bfe" "enc" "signature" "sig" "p12" "pem"))
    (dired-rainbow-define fonts "#6cb2eb" ("afm" "fon" "fnt" "pfb" "pfm" "ttf" "otf"))
    (dired-rainbow-define partition "#e3342f" ("dmg" "iso" "bin" "nrg" "qcow" "toast" "vcd" "vmdk" "bak"))
    (dired-rainbow-define vc "#0074d9" ("git" "gitignore" "gitattributes" "gitmodules"))
    (dired-rainbow-define-chmod executable-unix "#38c172" "-.*x.*"))
#+end_src
*** Tweaks
#+begin_src emacs-lisp
(use-package dired-single
  :ensure
  :defer t)
(use-package dired-ranger
  :ensure
  :defer t)
(use-package dired-collapse
  :ensure
  :defer t)
#+end_src
*** Keybinds
#+begin_src emacs-lisp
(evil-collection-define-key 'normal 'dired-mode-map
    "h" 'dired-single-up-directory
    "H" 'dired-omit-mode
    "l" 'dired-single-buffer
    "y" 'dired-ranger-copy
    "X" 'dired-ranger-move
    "p" 'dired-ranger-paste)
#+end_src
** OpenFile
Funziona con find-file per dired invece bisogna usare il keybind !
#+begin_src emacs-lisp
(use-package openwith
  :ensure
  :defer 1
  :if (display-graphic-p)
  :config
  (setq openwith-associations
        (list
          (list (openwith-make-extension-regexp
                '("mpg" "mpeg" "mp3" "mp4"
                  "avi" "wmv" "wav" "mov" "flv"
                  "ogm" "ogg" "mkv"))
                "open"
                '(file))
          (list (openwith-make-extension-regexp
                '("xbm" "pbm" "pgm" "ppm" "pnm"
                  "png" "gif" "bmp" "tif" "jpeg")) ;; Removed jpg because Telega was
                  ;; causing feh to be opened...
                  "open"
                  '(file))
          (list (openwith-make-extension-regexp
                '("pdf"))
                "open"
                '(file)))))
#+end_src
* Org roam
Mega modulo che richiede il suo header a parte.
** Funzioni di appoggio
Per il momento nulla.
** Configurazione
Momentaneamente disattivato, forse troppo scomodo
*** Init
#+begin_src emacs-lisp 
(use-package org-roam
  :straight t
  :after org
  :defer t
  :custom
  (org-roam-directory org-agenda-base)
  (org-roam-completion-everywhere t)
  (org-roam-completion-system 'default)
  (org-roam-dailies-directory "journals")
  (org-roam-capture-templates
   '(
     ("d" "default" plain "%?"
    :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n")
    :unnarrowed t)
     )
   )
#+end_src
*** Config
#+begin_src emacs-lisp
  :config
  (require 'org-roam-dailies)
  (org-roam-db-autosync-mode))
#+end_src

* Ledger
#+begin_src emacs-lisp
(use-package ledger-mode
  :ensure t
  :mode ("\\.dat\\'"
         "\\.ledger\\'")
  :config
  (add-hook 'ledger-mode-hook #'ledger-flymake-enable)
)
#+end_src
** Evil Ledger
#+begin_src emacs-lisp
(use-package evil-ledger
  :ensure t
  :after ledger-mode
  :config
  (setq evil-ledger-sort-key "S")
  (add-hook 'ledger-mode-hook #'evil-ledger-mode))
#+end_src
* Bibtex
#+begin_src emacs-lisp
#+end_src
* Git
** Magit
#+begin_src emacs-lisp
(use-package magit
  :ensure
  :commands (magit-status magit-get-current-branch)
  :init
  (fd/supreme-leader
    "g" '(:ignore t :which-key "Git")
    "gs" '(magit-status :which-key "Status")
    )
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
#+end_src
** Git-link
Apri il link alla repo con un tasto
#+begin_src emacs-lisp
(use-package git-link
  :ensure
  :commands git-link
  :config
  (setq git-link-open-in-browser t))
#+end_src
** Git-gut
#+begin_src emacs-lisp
(use-package git-gutter
  :straight git-gutter-fringe
  :diminish
  :hook ((text-mode . git-gutter-mode)
         (prog-mode . git-gutter-mode))
  :config
  (setq git-gutter:update-interval 2)
  (setq git-gutter:modified-sign "!")
  (setq git-gutter:added-sign "+")
  (setq git-gutter:deleted-sign "-")
  (set-face-foreground 'git-gutter:added "LightGreen")
  (set-face-foreground 'git-gutter:modified "LightGoldenrod")
  (set-face-foreground 'git-gutter:deleted "LightCoral"))
#+end_src
* Progetti
** Projectile
#+begin_src emacs-lisp
(use-package projectile
  :ensure t
  :defer t
  :diminish projectile-mode
  :config
  (projectile-mode)
)
#+end_src
** Perspective
#+begin_src emacs-lisp :tangle no
(use-package perspective
  :demand t
  :custom
  (persp-initial-frame-name "Main")
  :config
  ;; Running `persp-mode' multiple times resets the perspective list...
  (unless (equal persp-mode t)
    (persp-mode)))
#+end_src
* LSP
