emacs/.emacs.d/init.el

(use-package lsp-mode
  :ensure t
  :hook (;; replace XXX-mode with concrete major-mode(e. g. python-mode)
         (python-mode . lsp)
         ;; if you want which-key integration
         (lsp-mode . lsp-enable-which-key-integration))
  :init
  ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
  (setq lsp-keymap-prefix "C-c l")
    :commands lsp)
(use-package lsp-ui
  :ensure t
  :commands lsp-ui-mode)

(use-package dap-mode
  :ensure t
  :after org
  )

(use-package anaconda-mode
  :ensure t
  :hook (python-mode-hook . anaconda-mode)
  :hook (python-mode-hook . anaconda-eldoc-mode)
)

(use-package poetry
 :ensure t
 :hook (python-mode-hook .poetry-tracking-mode))

(use-package elfeed
  :ensure t
  :commands elfeed
  :init
  (fd/supreme-leader
    "e" '(:ignore t :which-key "Elfeed")
    "eo" '(elfeed :which-key "Feeds")
    "eu" '(elfeed-update :which-key "Update")
    )
  :config
  (setq elfeed-feeds
	'(("http://export.arxiv.org/api/query?search_query=cat:cs.LG&start=0&max_results=300&sortBy=submittedDate&sortOrder=descending")
      ("[[http://export.arxiv.org/api/query?search_query=cat:stat.TH&start=0&max_results=300&sortBy=submittedDate&sortOrder=descending]]")))
;;  (setq elfeed-feeds
	;;'("http://export.arxiv.org/api/query?search_query=cat:cs.LG"
      ;;"[[http://export.arxiv.org/api/query?search_query=cat:stat.TH]]")
	;;)
  ;;(setq-default elfeed-search-filter "=start=0 max_results=300 =sortBy=submittedDate =sortOrder=descending #30 ")
  (require 'elfeed-arxiv-aspect)
  (require 'elfeed-arxiv-excerpts)

)

(use-package elfeed-score
  :ensure t
  :after elfeed
  :config
  (elfeed-score-load-score-file "~/.emacs.d/lisp/elfeed/elfeed.score") ; See the elfeed-score documentation for the score file syntax
  (setq elfeed-score-serde-score-file "elfeed.score")
  (elfeed-score-enable)
  ;;(define-key elfeed-search-mode-map "=" elfeed-score-map)
  )
